---
type: StructuralSectionIWelded
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 7
tags: [revit-api, class]
---

# StructuralSectionIWelded

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWelded` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionIWelded | 2015 | `public StructuralSectionIWelded ( double width , double height , double topFlangeThickness , double topFlangeWidth , double bottomFlangeThickness , double bottomFlangeWidth , double webThickness , double webHeight , doub` |
| Property | BottomFlangeThickness | 2015 | `public double BottomFlangeThickness { get ; set ; }` |
| Property | BottomFlangeWidth | 2015 | `public double BottomFlangeWidth { get ; set ; }` |
| Property | TopFlangeThickness | 2015 | `public double TopFlangeThickness { get ; set ; }` |
| Property | TopFlangeWidth | 2015 | `public double TopFlangeWidth { get ; set ; }` |
| Property | WebHeight | 2015 | `public double WebHeight { get ; set ; }` |
| Property | WebThickness | 2015 | `public double WebThickness { get ; set ; }` |